Catalogs/бит_Квартиры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Квартиры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СписокЗданий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодъезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерКвартирыДляСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_Квартиры/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// БИТ_ЖКХ Процедура формирует наименование элемента
//
Процедура СформироватьНаименование() Экспорт
	
	Если ЗначениеЗаполнено(НомерКвартиры) тогда
		Наименование = Строка(НомерКвартиры) + Строка(ПрефиксКвартиры);
	Иначе
		Наименование = Строка(ПрефиксКвартиры);
	КонецЕсли;	
	бит_НомерКвартирыДляСортировки = ПолучитьНомерИзСтроки(НомерКвартиры);
КонецПроцедуры // СформироватьНаименование() 

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

Функция ПолучитьНомерИзСтроки(Строка)
	СтрокаЧисла = "";
	КоличествоСимволов = СтрДлина(СокрЛП(Строка));
	Для Порядок = 1 По КоличествоСимволов Цикл
		Символ = Сред(Строка, Порядок, 1);
		Если НЕ СтрНайти("0123456789", Символ) = 0 Тогда
			СтрокаЧисла = СтрокаЧисла + Символ;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;      
	
	Возврат Число(СтрокаЧисла);
	
КонецФункции

// Проверяет уникальность квартиры
Процедура ПроверитьУникальностьКвартиры(Отказ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_Квартиры.Ссылка
	|ИЗ
	|	Справочник.бит_Квартиры КАК бит_Квартиры
	|ГДЕ
	|	бит_Квартиры.Наименование = &Наименование
	|	И бит_Квартиры.Владелец = &Владелец
	|	И бит_Квартиры.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("Владелец",Владелец);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	//Если Не Запрос.Выполнить().Пустой() тогда
	//	бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный номер квартиры уже существует!",Отказ,,СтатусСообщения.Важное);
	//КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Проверяем на заполнение обязательные реквизиты
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНаименование();
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку
		Возврат;
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураРеквизитов = Новый Структура();
	// СтруктураРеквизитов.Вставить("Наименование");
	Если НЕ ПрефиксКвартиры = "-" тогда
		СтруктураРеквизитов.Вставить("НомерКвартиры");	
	КонецЕсли;	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитов, Отказ, "Проверка заполнения обязательных реквизитов элемента справочника ""Квартиры"".");
	Если Не ЗначениеЗаполнено(НомерКвартиры) И НЕ ПрефиксКвартиры = "-"  тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Если в доме нет квартиры, то в префиксе нужно проставить прочерк.");
		
	КонецЕсли;	
	Если Не Отказ тогда
		ПроверитьУникальностьКвартиры(Отказ);
	КонецЕсли;
	
	//// БИТ_ЖКХ 05.07.2016 14:47:12 Начало правки... Не востребовано.
	//ПроверкаКоличестваКомнат();
	//// БИТ_ЖКХ 05.07.2016 14:47:12 Конец правки.
	
КонецПроцедуры

//// БИТ_ЖКХ 05.07.2016 14:47:57 Начало правки...  Не востребовано.
//Процедура ПроверкаКоличестваКомнат() Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	бит_Комнаты.Ссылка КАК Комната,
//	|	бит_Комнаты.ЧастьПомещения КАК ЧастьПомещения
//	|ПОМЕСТИТЬ ВТ_комнаты
//	|ИЗ
//	|	Справочник.бит_Комнаты КАК бит_Комнаты
//	|ГДЕ
//	|	бит_Комнаты.Владелец = &Владелец
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ЧастьПомещения
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_комнаты.Комната) КАК КоличествоКомнат
//	|ИЗ
//	|	ВТ_комнаты КАК ВТ_комнаты
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НазначениеЧастейПомещения КАК бит_НазначениеЧастейПомещения
//	|		ПО ВТ_комнаты.ЧастьПомещения = бит_НазначениеЧастейПомещения.Ссылка
//	|ГДЕ
//	|	бит_НазначениеЧастейПомещения.ТипКомнаты = ЗНАЧЕНИЕ(Справочник.бит_ТипыКомнат.Жилая)";
//	
//	Запрос.УстановитьПараметр("Владелец", Ссылка);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		ЭтотОбъект.КоличествоКомнат	 = Выборка.КоличествоКомнат;
//	Иначе
//		ЭтотОбъект.КоличествоКомнат	 = 0;
//	КонецЕсли;
//	
//КонецПроцедуры
//// БИТ_ЖКХ 05.07.2016 14:47:58 Конец правки. 

#КонецОбласти

#КонецЕсли
